project-4-backend/app/controllers/races_controller.rb

    def set_race
      @race = Race.find(params[:id])
---
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]