app/controllers/drones_controller.rb

SELECT "drones".* FROM "drones"
---
  def index
    @drones = Drone.all

SELECT  "drones".* FROM "drones" WHERE "drones"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_drone
      @drone = Drone.find(params[:id])